## "Перевод времени"

### Задание

Пользователь вводит число в секундах, программа пересчитывает его в количество дней, часов, минут, секунд.

### Формат входных данных

На вход программе подается целое положительное число - количество секунд.

### Формат выходных данных

Требуется вывести время в формате: x дней y часов z минут w секунд.

Согласовывать окончания(д**ень**/дн**ей**/дн**я**) не нужно.

### Решение задачи

def convert_format(sec):
    dey = sec // 86400
    sec %= 86400
    sec = sec % (24 * 3600)
    hour = sec // 3600
    sec %= 3600
    min = sec // 60
    sec %= 60
    print("в днях:", dey)
    print("в часах:",hour)
    print("в минутах:",min)
    print("в секундах:", sec)
    return "%02d Дней %02dч : %02dм : %02dс" % (dey, hour, min, sec)

second = int(input("Прошло секунд:"))
print("Время в удобном формате :-", convert_format(second))

---

### Данные для самопроверки
|   seconds   |  |   result   |
| :---:      | ---| :---      |
|   315   |  |   0 дней 0 часов 5 минут 15 секунд  | 
|   43200   |  |   0 дней 12 часов 0 минут 0 секунд  | 
|   25800  |  |  0 дней 7 часов 10 минут 0 секунд  |  
|   93784  |  |  1 дней 2 часов 3 минут 4 секунд  |  
|   36  |  |  0 дней 0 часов 0 минут 36 секунд  |
